---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ForgeSchemaService
source: html/e4f4f85b-6132-f6fb-fa36-026a7d93af6c.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ForgeSchemaService Property

Autodesk Internal: The service for interacting with the Forge Schema Service.

## Syntax (C#)
```csharp
public static ExternalServiceId ForgeSchemaService { get; }
```